## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ses_receipt_rule.ffis_ingest will be updated in-place
  ~ resource "aws_ses_receipt_rule" "ffis_ingest" {
        id            = "grants_ingest-staging-ffis_ingest"
        name          = "grants_ingest-staging-ffis_ingest"
      ~ recipients    = [
-           "ffis-ingest@staging.grants.usdigitalresponse.org",
+           "ffis-ingest@staging.grants.usdr.dev",
        ]
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-28T14:55:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:19/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip"
      ~ s3_object_version              = "J82oSlJnCWvfz3eIa9YGycY4I7N4R6LN" -> (known after apply)
        tags                           = {}
      ~ version                        = "19" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:2d5a0dfff83c2721802dcfd3e44e85bbfb25eda7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:5a7d9499caee2ca3bad47733cc1eee2ccf42a639,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "2d5a0dfff83c2721802dcfd3e44e85bbfb25eda7" -> "5a7d9499caee2ca3bad47733cc1eee2ccf42a639"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "19" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2fc51f31b8a5c25d0d14692d58857c4a-2" -> (known after apply)
      ~ id                     = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> (known after apply)
      ~ key                    = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip"
-       tags                   = {} -> null
      ~ version_id             = "J82oSlJnCWvfz3eIa9YGycY4I7N4R6LN" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "923372331776132144" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip"
          ~ "timestamp" = "1682693614580749000" -> "1682696126009143200"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3391399264274043617" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3f8a0304d508d3a1633e75c99d597becb1638b2dd65923cf484a817f928a2cda.zip" -> "builds/a2d598d430b475e06c8fe752ba94c91b982051be4af48269705c411a445b16c6.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-28T14:55:29.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:18/invocations" -> (known after apply)
      ~ s3_key                         = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip"
      ~ s3_object_version              = "olWf2h0468VvIxFlGNpPaUGyHjp1mh1_" -> (known after apply)
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:2d5a0dfff83c2721802dcfd3e44e85bbfb25eda7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:5a7d9499caee2ca3bad47733cc1eee2ccf42a639,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "2d5a0dfff83c2721802dcfd3e44e85bbfb25eda7" -> "5a7d9499caee2ca3bad47733cc1eee2ccf42a639"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "18" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2ca194ac09af62b42b01d805b9703b55-2" -> (known after apply)
      ~ id                     = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> (known after apply)
      ~ key                    = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip"
-       tags                   = {} -> null
      ~ version_id             = "olWf2h0468VvIxFlGNpPaUGyHjp1mh1_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6876289265674931421" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip"
          ~ "timestamp" = "1682693614893279000" -> "1682696126448743200"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7266962383555721738" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/67a86a6e33383fe14c3b3baba87d2b3a1ccfea307164096e44bd8832f88a121a.zip" -> "builds/a1661c68df1d9285904c7605d6e9dd4201feef9e355bbd34daaa31fb9ff480c1.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 7 to change, 8 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4832292568)*